import React from "react";
import styles from './About.module.css'
import firstImg from '../../Assets/about/first-img.png'
import secondImg from '../../Assets/about/second-img.png'
import thirdImg from '../../Assets/about/third-img.png'


const About = () => {
    const items = [
        'Cьогодні під брендом AVON випускається найбільша кількість косметичних продуктів у світі',
        'Кожної секунди представники avon у всьому світі продають 4 помади',
        'Кожної години по всьому світі продається 2400 продуктів серії ANEW',
        'Кожен 4-й аромат, що продається в україні – AVON',
        'Фонд AVON для жінок – це найбільша корпоративна благодійна організація у світі, яка сфокусована на жіночих проблемах'
    ]
    return (
        <div className={styles['about-wrapper']}>
            <div className={styles['about-container']}>
                <h1>Історія компанії <span>Avon</span></h1>
                <p>Шлях від п’яти ароматів парфумів до прибутку в кілька мільярдів доларів!</p>
                <button>Стати партнером!</button>
                <ul className={styles['about-list']}>
                    {
                        items.map((item, index) => {
                            return (
                                <li key={index}>
                                    {item}
                                </li>
                            )
                        })
                    }
                </ul>
                <div className={styles['about-flexbox']}>
                    <div className={`${styles['about-flexitem']} ${styles['about-decoration']}`}>
                        <p>З тих пір, як в 1886 році засновник компанії Дейвід Макконнелл випустив у продаж перший продукт - парфумерний набір Little Dot Perfume Set, AVON пройшла великий шлях. Сьогодні це найбільша в світі компанія, яка стала настільки відомою завдяки організації і розвитку системи прямих продажів. Ідея продавати парфумерію і косметику жінкам через торгових агентів народилася, коли Девід працював комівояжером в одному з Чиказьких видань. Своїм клієнткам як подарунок за покупку книги Девід дарував маленький флакончик парфумів. І цей маленький подарунок став настільки популярним серед його клієнток, що змусив Дейвіда замислитися над питанням: «Чого ж більше чекають від нього його клієнтки: книгу або новий аромат?» Книжки стали минулим для Макконнелла, в парфумерії він бачив набагато більше перспектив. Так в 1886 році була заснована компанія California Perfume.</p>
                        <div className={styles['about-img-block']}>
                            <img src={firstImg} alt='inventor'/>
                            <p>Засновник компанії AVON – Девід Макконнелл</p>
                        </div>
                    </div>
                    <div className={styles['about-flexitem']}>
                        <div className={styles['about-img-block']}>
                            <img src={secondImg} alt='california-perfume-company'/>
                            <p>California Perfume Company</p>
                        </div>
                        <p>У 1915 році «Каліфорнійська Парфумерна Компанія» була визнана гідною золотої премії на виставці Panama-Pacific за високу якість усього асортименту продукції та дизайн упаковки. На сьогоднішній день 100% гарантія якості залишається візитною карткою компанії. На початку минулого сторіччя компанія стрімко і успішно розвивається, розширюючи свої географічні кордони. Назва «Каліфорнійська парфумна компанія» вже не відображала суті бізнесу. Дейвід Макконнелл-молодший, син засновника, який керував компанією на той момент, перейменовує компанію в AVON на честь міста Стредфорда-на-Ейвон, де народився Вільям Шекспір – улюблений письменник батька.</p>
                    </div>
                    <div className={styles['about-flexitem']}>
                        <p>У 1915 році «Каліфорнійська Парфумерна Компанія» була визнана гідною золотої премії на виставці Panama-Pacific за високу якість усього асортименту продукції та дизайн упаковки. На сьогоднішній день 100% гарантія якості залишається візитною карткою компанії. На початку минулого сторіччя компанія стрімко і успішно розвивається, розширюючи свої географічні кордони. Назва «Каліфорнійська парфумна компанія» вже не відображала суті бізнесу. Дейвід Макконнелл-молодший, син засновника, який керував компанією на той момент, перейменовує компанію в AVON на честь міста Стредфорда-на-Ейвон, де народився Вільям Шекспір – улюблений письменник батька.</p>
                        <div className={styles['about-img-block']}>
                            <img src={thirdImg} alt='avon-calling-commercial'/>
                            <p>Avon Calling Commercial</p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default About